Autodesk.Revit.DB.Structure.IStructuralSectionsServer.StructuralSectionsUpdate(Autodesk.Revit.DB.Structure.StructuralSectionsServiceData)
The server's method that will be called when Revit User clicks the Section Type parameter's button in the family dialog.
Remarks:
The server provides UI way for Revit user to view and modify the detail data corresponding with the parameter value.
The server may also modify the section type parameter value itself during the execution.
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
data:
The Section Type data.
Returns:
Indicates whether the section type parameter server is executed successfully.
Since:
2015

Autodesk.Revit.DB.Structure.IStructuralSectionsServer
Interface for the section type parameter server to implement.
Since:
2015